const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "📁",

    desc: "Get bot command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let TerraMenu = ╔══════════════════════════╗
║ ⚡️🖤 SNOW-MD 🖤⚡️ ║
╚══════════════════════════╝

👤 User      : @${sender.split("@")[0]}
⏱️ Uptime    : *${uptime()}*
⚙️ Mode      : ${config.MODE || "public"}
💠 Prefix    : [${usedPrefix}]
📦 Plugins   : *${totalCommands}*
🖥️ Host      : *${hostName}*
👑 Developer : *JON SNOW TECH*🇭🇹
📆 Date      : *${date}*

────────────────────────────
`;

> *╭⭑━━━━━➤❄️*
> *┃💺* *\`ᴅᴏᴡɴʟᴏᴀᴅ-ᴍᴇɴᴜ\`*
> *┣➢🎠* *.ғʙ*
> *┣➢🗿* *.ɪɴꜱᴛᴀ*
> *┣➢🛸* *.ᴠɪᴅᴇᴏ*
> *┣➢🛑* *.ɢᴅʀɪᴠᴇ*
> *┣➢⚓* *.ᴛᴡɪᴛᴛᴇʀ*
> *┣➢🍹* *.ᴛᴛ*
> *┣➢🍸* *.ᴍᴇᴅɪᴀғɪʀᴇ*
> *┣➢🍭* *.ᴘʟᴀʏ*
> *┣➢🥤* *.sᴏɴɢ*
> *┣➢🐾* *.ᴠɪᴅᴇᴏ*
> *┣➢🕸️* *.sᴘᴏᴛɪꜰʏ*
> *┣➢🦥* *.ᴠɪᴅᴇᴏ4*
> *┣➢🪐* *.ɪᴍɢ*
> *┣➢🌎* *.Lʏʀɪᴄs*
> *┣➢💧* *.ᴀᴘᴋ*
> *┣➢🌊* *.ʙᴀɪsᴄᴏᴘᴇ*
> *┣➢🔥* *.ɢɪɴɪsɪsɪʟᴀ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤🇭🇹*
> *┃🍂* *\`sᴇᴀʀᴄʜ-ᴍᴇɴᴜ\`*
> *┣➢🌼* *.ʏᴛꜱ*
> *┣➢🍄* *.ʏᴛᴀ*
> *┣➢🌹* *.ᴍᴏᴠɪᴇɪɴғᴏ*
> *┣➢🧑‍🎨* *.ᴍᴏᴠɪᴇ*
> *┣➢🤵* *.Gᴏᴏɢʟᴇ*
> *┣➢🏋️* *.ᴡᴇᴀᴛʜᴇʀ*
> *┣➢💢* *.sᴛɪᴄᴋsᴇᴀʀᴄʜ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤✒️*
> *┃👾* *\`ɢᴀᴍᴇ-ᴍᴇɴᴜ\`*
> *┣➢👽* *.ɴᴜᴍʙᴇʀɢᴀᴍᴇ*
> *┣➢🤡* *.ʀᴏʟʟ*
> *┣➢🥶* *.ᴄᴏɪɴꜰʟɪᴘ*
> *┣➢🤯* *.pick*
> *┣➢⚖️* *.ᴋᴏɴᴀᴍɪ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤💫*
> *┃🕯️* *\`ɴsғᴡ-ᴍᴇɴᴜ\`*
> *┣➢🔦* *.ɴsғᴡᴍᴇɴᴜ*
> *┣➢🖨️* *.ᴛᴇʀʀᴀɴᴜᴅᴇ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤⚡*
> *┃🪢* *\`ᴀɪ-ɢᴘᴛ-ᴍᴇɴᴜ\`*
> *┣➢🛰️* *.ɢᴘᴛ*
> *┣➢🔗* *.ᴀɪ*
> *┣➢🧬* *.ᴀɴᴀʟʏsᴇ*
> *┣➢🔬* *.ʟʟᴀᴍᴀ3*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤✨*
> *┃✂️* *\`ᴏᴡɴᴇʀ-ᴍᴇɴᴜ\`*
> *┣➢📏* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
> *┣➢🖌️* *.sᴇᴛᴛɪɴɢs*
> *┣➢🩹* *.ᴏᴡɴᴇʀ*
> *┣➢🌂* *.ʀᴇᴘᴏ*
> *┣➢🎓* *.ꜱʏꜱᴛᴇᴍ*
> *┣➢🪞* *.ꜱᴛᴀᴛᴜꜱ*
> *┣➢🧾* *.Aʙᴏᴜᴛ*
> *┣➢🏮* *.ʙʟᴏᴄᴋ*
> *┣➢📠* *.ᴇᴠᴀʟ*
> *┣➢💾* *.ᴜɴʙʟᴏᴄᴋ*
> *┣➢📱* *.sʜᴜᴛᴅᴏᴡɴ*
> *┣➢🕰️* *.ᴄʟᴇᴀʀᴄʜᴀᴛs*
> *┣➢📨* *.sᴇᴛᴘᴘ*
> *┣➢📜* *.ʙʀᴏᴀᴅᴄᴀsᴛ*
> *┣➢🔓* *.ᴊɪᴅ*
> *┣➢🕘* *.ɢᴊɪᴅ*
> *┣➢⚪* *.sᴀᴠᴇ*
> *┣➢🧡* *.ᴄᴀʟᴄ*
> *┣➢♈* *.ʀᴇꜱᴛᴀʀᴛ*
> *┣➢♊* *.sᴇᴛsᴜᴅᴏ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤🌟*
> *┃❗* *\`ɢʀᴏᴜᴘ-ᴍᴇɴᴜ\`*
> *┣➢⚧️* *.ʀᴇᴍᴏᴠᴇ*
> *┣➢⭕* *.ᴅᴇʟ*
> *┣➢🚫* *.ᴀᴅᴅ*
> *┣➢🛑* *.ᴋɪᴄᴋ*
> *┣➢✳️* *.ᴋɪᴄᴋᴀʟʟ*
> *┣➢♻️* *.sᴇᴛɢᴏᴏᴅʙʏᴇ*
> *┣➢💱* *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
> *┣➢⚜️* *.ᴘʀᴏᴍᴏᴛᴇ*
> *┣➢💹* *.ᴅᴇᴍᴏᴛᴇ*
> *┣➢✅* *.ᴛᴀɢᴀʟʟ*
> *┣➢↗️* *.ɢᴇᴛᴘɪᴄ*
> *┣➢🔹* *.ɪɴᴠɪᴛᴇ*
> *┣➢🚹* *.ʀᴇᴠᴏᴋᴇ*
> *┣➢✝️* *.ᴘᴏʟʟ*
> *┣➢✡️* *.ʀᴀɴᴅᴏᴍsʜɪᴘ*
> *┣➢🎼* *.ɴᴇᴡɢᴄ*
> *┣➢➰* *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
> *┣➢〰️* *.ᴀʟʟʀᴇǫ*
> *┣➢🇦🇱* *.ᴍᴜᴛᴇ*
> *┣➢📴* *.ᴜɴᴍᴜᴛᴇ*
> *┣➢✴️* *.ʟᴏᴄᴋɢᴄ*
> *┣➢🆘* *.ᴜɴʟᴏᴄᴋɢᴄ*
> *┣➢♐* *.ʟᴇᴀᴠᴇ*
> *┣➢♊* *.ɢɴᴀᴍᴇ*
> *┣➢🈹* *.ɢᴅᴇsᴄ*
> *┣➢🈶* *.ᴊᴏɪɴ*
> *┣➢🔅* *.ʜɪᴅᴇᴛᴀɢ*
> *┣➢🔂* *.ɢɪɴғᴏ*
> *┣➢🔽* *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏɴ*
> *┣➢🎦* *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏғғ*
> *┣➢〽️* *.ᴇᴘʜᴇᴍᴇʀᴀʟ 7ᴅ 24ʜ 90ᴅ*
> *┣➢🚸* *.sᴇɴᴅᴅᴍ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤🎗️*
> *┃☯️* *\`ɪɴғᴏ-ᴍᴇɴᴜ\`*
> *┣➢🛃* *.ᴀʙᴏᴜᴛ*
> *┣➢⚛️* *.Dᴇᴠ*
> *┣➢☸️* *.ᴀʟɪᴠᴇ*
> *┣➢♾️* *.ʀᴇǫᴜᴇsᴛ*
> *┣➢™️* *.ʙᴏᴛɪɴꜰᴏ*
> *┣➢🔘* *.ꜱᴛᴀᴛᴜꜱ*
> *┣➢🔳* *.ᴘɪɴɢ*
> *┣➢🛅* *.ᴘɪɴɢ2*
> *┣➢🏧* *.ꜱʏꜱᴛᴇᴍ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤🎩*
> *┣➢☢️* *\`ʀᴇʟɪɢɪᴏɴ-ᴍᴇɴᴜ\`*
> *┣➢💫* *.ʙɪʙʟᴇ*
> *┣➢❄️* *.ʙɪʙʟᴇʟɪsᴛ*
> *┣➢😮‍💨*  *logo*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤💻*
> *┃🌀* *\`ʙᴏᴛ-ᴍᴇɴᴜ\`*
> *┣➢🎗️* *.ᴠᴇʀsɪᴏɴ*
> *┣➢🍷* *.ʀᴇᴘᴏ*
> *┣➢⏳* *.ᴍᴇɴᴜ*
> *┣➢⚡* *.ᴄʜᴇᴄᴋᴜᴘᴅᴀᴛᴇ*
> *┣➢🕳️* *.ᴜᴘᴅᴀᴛᴇ*
> *┣➢💫* *.ᴍᴏᴅᴇ*
> *┣➢👻* *.ᴀᴜᴛᴏᴛʏᴘɪɴɢ*
> *┣➢🌬️* *.ᴀʟᴡᴀʏsᴏɴʟɪɴᴇ*
> *┣➢☄️* *.ᴀᴜᴛᴏʀᴇᴄᴏʀᴅɪɴɢ*
> *┣➢🦋* *.ᴀᴜᴛᴏʀᴇᴀᴅsᴛᴀᴛᴜs*
> *┣➢🥃* *.ᴀɴᴛɪʙᴀᴅ*
> *┣➢🚀* *.ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ*
> *┣➢⛲* *.ᴀᴜᴛᴏʀᴇᴘʟʏ*
> *┣➢🌐* *.ᴀᴜᴛᴏʀᴇᴀᴄᴛ*
> *┣➢🎀* *.ᴀɴᴛɪʟɪɴᴋ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤🛠️*
> *┃🥇* *\`ᴄᴏɴᴠᴇʀᴛ-ᴍᴇɴᴜ\`*
> *┣➢🥈* *.sᴛɪᴄᴋᴇʀ*
> *┣➢🥉* *.ᴛᴀᴋᴇ*
> *┣➢🏅* *.ᴛʀᴛ*
> *┣➢🎖️* *.ᴛᴛs*
> *┣➢🏆* *.ꜰᴀɴᴄʏ*
> *┣➢🕹️* *.ᴜʀʟ*
> *┣➢🪄* *.sᴇɴᴅɪᴍᴀɢᴇ*
> *┣➢🎭* *.Aɢᴇ*
> *┣➢👑* *.Cᴏɴᴠᴇʀᴛ*
> *┣➢💉* *.ᴛɪɴʏ*
> *┣➢⚒️* *.ᴛɢs*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤📜*
> *┃🪝* *\`ᴏᴛʜᴇʀ-ᴍᴇɴᴜ\`*
> *┣➢🧰* *.ᴛʀᴛ*
> *┣➢⚙️* *.ᴊᴏᴋᴇ*
> *┣➢⛓️* *.ꜰᴀᴄᴛ*
> *┣➢🔖* *.ɢɪᴛʜᴜʙ*
> *┣➢⌚* *.ɢᴘᴀꜱꜱ*
> *┣➢🗳️* *.ʜᴀᴄᴋ*
> *┣➢📅* *.ǫᴜᴏᴛᴇ*
> *┣➢🗡️* *.ǫʀ*
> *┣➢🟠* *.vv*
> *┣➢♉* *.sᴘᴀᴍ*
> *┣➢♈* *.ᴠᴄᴀʀᴅ*
> *┣➢♨️* *.ꜱʀᴇᴘᴏ*
> *┣➢🔶* *.sʏsᴛᴇᴍ*
> *┣➢☣️* *.ʀᴀɴᴋ*
> *┣➢⚠️* *.Tɪᴍᴇᴢᴏɴᴇ*
> *┣➢☢️* *.ᴅᴇꜰɪɴᴇ*
> *┣➢💲* *.Dᴀɪʟʏꜰᴀᴄᴛ*
> *┣➢💠* *.Mɪɴᴜᴛᴏʀ*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤🔏*
> *┃Ⓜ️* *\`ᴡᴀʟʟᴘᴀᴘᴇʀ-ᴍᴇɴᴜ\`*
> *┣➢👁️‍🗨️* *.ɪᴍɢ*
> *┣➢🔳* *.ss*
> *╰⭑━━➤* *ʙʏ jon snow*

> *╭⭑━━━━━➤☢️*
> *┃🇭🇹* *\`ʀᴀɴᴅᴏᴍ-ᴍᴇɴᴜ\`*
> *┣➢🪧* *.ᴅᴏɢ*
> *┣➢📌* *.ᴄᴀᴛ*
> *┣➢📍* *.ᴅɪᴀʀʏ*
> *┣➢📎* *.ᴀɴɪᴍᴇ*
> *┣➢🗜️* *.ᴄᴏᴜᴘʟᴇᴘᴘ*
> *┣➢📡* *.ꜰɪɴᴅɴᴀᴍᴇ*
> *┣➢🧸* *.ʟᴏʟɪ*
> *┣➢💡* *.ᴡᴀɪꜰᴜ*
> *┣➢💰* *.ᴄᴏsᴘʟᴀʏ*
> *┣➢💎* *.ɴᴇᴋᴏ*
> *┣➢📀* *.ʀᴀɴᴅᴏᴍᴀɴɪᴍᴇ*
> *┣➢💿* *.Sᴇɴᴅɪᴍᴀɢᴇ*
> *┣➢📱* *.ᴀɴɪᴍᴇɢɪʀʟ*
> *┣➢🔋* *.ᴀɴɪᴍᴇɢɪʀʟ1*
> *┣➢💷* *.ᴀɴɪᴍᴇɢɪʀʟ2*
> *┣➢💳* *.ᴀɴɪᴍᴇɢɪʀʟ3*
> *┣➢🎨* *.ᴀɴɪᴍᴇɢɪʀʟ4*
> *┣➢🎊* *.ᴀɴɪᴍᴇɢɪʀʟ5*
> *┣➢🧨* *.ᴘɪᴄᴋᴜᴘʟɪɴᴇ*
> *╰⭑━━➤* *ʙʏ jon snow*
> *© ᴘᴏᴡᴇʀᴇᴅ ʙʏ jon snow*`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:TerraMenu,
                          contextInfo: {
    mentionedJid: [m.sender],
    forwardingScore: 999,
    isForwarded: true,
    forwardedNewsletterMessageInfo: {
      newsletterJid: '120363400596152474@newsletter',
      newsletterName: 'jon snow',
      serverMessageId: 999
    }
  }
}, { quoted: mek });
}catch(e){
console.log(e)
reply(`${e}`)
}
})
